## Pandas

In [73]:
import pandas as pd
import numpy as np

1.Series <br>
   * Using List<br>
   * Using Array
   * Using Dictionary
   
2.Create DataFrame<br>
   * Using Lists
   * Using Dictionary   
   
3.Copy Dataframe <br>
4.Select/Keep columns<br>
5.Create /add new columns<br>
6.Select rows<br>
7.Select rows and columns<br>
8.Drop Rows<br>
9.Drop Columns<br>
10.Rename Columns<br>
11.Sorting DataFrame<br>
12.Filter based on conditions<br>
13.Filter based on conditional operators<br>
  * Using Basic method
  * using filter function
  * Using query function
  
14.Reset and Set index<br>
15.Missing Data<br>
16.Group by operation<br>
17.Merging Concept : Concatation,Append,Merge,join<br>

## Series

#### 1. Using List

In [2]:
character=['a','b','c']
number=[1,2,3]

In [4]:
#Numeric Series
pd.Series(data=number)

0    1
1    2
2    3
dtype: int64

In [5]:
#Character Series
pd.Series(data=character)

0    a
1    b
2    c
dtype: object

In [8]:
# value is number and index is character
pd.Series(data=number,index=character)

a    1
b    2
c    3
dtype: int64

In [10]:
ser1=pd.Series(number,character)
ser1

a    1
b    2
c    3
dtype: int64

In [11]:
#extract first value from series:series[index]
ser1[0]

1

#### 2. Using Array

In [15]:
arr=np.array(number)
print(arr)

[1 2 3]

In [14]:
pd.Series(arr,character)

a    1
b    2
c    3
dtype: int32

#### 3. Using Dictionary

In [17]:
dist={'a':1,'b':2,'c':3}
print(dist)

{'a': 1, 'b': 2, 'c': 3}

In [19]:
pd.Series(dist)

a    1
b    2
c    3
dtype: int64

### Addition of series

In [21]:
s1=[5,6,7,8]
l1=['a','b','c','d']
s2=[1,2,3]
l2=['a','c','e']

series1=pd.Series(s1,l1)
series2=pd.Series(s2,l2)
print(series1)
print(series2)

a    5
b    6
c    7
d    8
dtype: int64
a    1
c    2
e    3
dtype: int64

In [22]:
# addition/subtraction operation is done by index matched .unmatched index values are nan
series1+series2

a    6.0
b    NaN
c    9.0
d    NaN
e    NaN
dtype: float64

## Data Frame

#### Create DataFrame

#### Create a DataFrame from Lists
The DataFrame can be created using a single list or a list of lists.

In [36]:
list1=[1,2,3,4]
pd.DataFrame(list1,columns=['series'])

   series
0       1
1       2
2       3
3       4

In [38]:
list2=[['a',1],['b',2],['c',3]]
pd.DataFrame(list2,columns=['Number','Character'])

  Number  Character
0      a          1
1      b          2
2      c          3

####  Create a DataFrame from Dict of ndarrays / Lists

In [86]:
Age=[12,15,56,89]
Salary=[6000,7000,8000,9000]
Name=['A','B','C','D']
index=['first','second','third','four']
df=pd.DataFrame({'Name': Name,'Age':Age,'Salary':Salary},index=index)
df

       Name  Age  Salary
first     A   12    6000
second    B   15    7000
third     C   56    8000
four      D   89    9000

#### Copy DataFrame

In [87]:
df2=df.copy()
df2

       Name  Age  Salary
first     A   12    6000
second    B   15    7000
third     C   56    8000
four      D   89    9000

#### Check Columns names in dataframe

In [88]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='object')

#### Select/Keep columns

In [89]:
#Dataframe[columnnames]
df['Name']

first     A
second    B
third     C
four      D
Name: Name, dtype: object

In [90]:
df[['Name','Age']]

       Name  Age
first     A   12
second    B   15
third     C   56
four      D   89

#### Create /add new columns

In [91]:
df['new']=df['Age']+df['Salary']
df

       Name  Age  Salary   new
first     A   12    6000  6012
second    B   15    7000  7015
third     C   56    8000  8056
four      D   89    9000  9089

#### Select Rows
Select rows using 2 methods:<br>
1.iloc=select row based on index label<br>
2.loc=select row based on index position

In [92]:
#select first row by row name
df.loc['first']

Name         A
Age         12
Salary    6000
new       6012
Name: first, dtype: object

In [93]:
#select first row by row number
df.iloc[0]

Name         A
Age         12
Salary    6000
new       6012
Name: first, dtype: object

In [94]:
## Select 2 & 3rd row
df.iloc[[1,2]]

       Name  Age  Salary   new
second    B   15    7000  7015
third     C   56    8000  8056

#### Select rows and columns

In [96]:
#Select 3rd row and column 'Name' and 'Age'
df.iloc[2,[0,1]]

Name     C
Age     56
Name: third, dtype: object

In [97]:
#Select 3rd,4th row and column 'Name' and 'Age'
df.iloc[[2,3],[0,1]]

      Name  Age
third    C   56
four     D   89

In [98]:
#Select 3rd,4th row and column 'Name' and 'Age'
df.loc[['third','four'],['Name','Age']]

      Name  Age
third    C   56
four     D   89

#### Drop Rows

In [100]:
#dataframe.drop(index,axis=0)
df.drop('third',axis=0)

       Name  Age  Salary   new
first     A   12    6000  6012
second    B   15    7000  7015
four      D   89    9000  9089

#### Drop Columns

In [101]:
# axis=1: operation column wise
# axis=0 :operation row wise
#dataframe.drop(index label,axis=1)
df.drop('Age',axis=1)

       Name  Salary   new
first     A    6000  6012
second    B    7000  7015
third     C    8000  8056
four      D    9000  9089

#### Rename Columns

In [102]:
df.rename({'Name':'Student Name','Age':'Student Age'},axis=1)

       Student Name  Student Age  Salary   new
first             A           12    6000  6012
second            B           15    7000  7015
third             C           56    8000  8056
four              D           89    9000  9089

In [103]:
#inplace=True:overwrite the existing dataset
df.rename({'Name':'Student Name','Age':'Student Age'},axis=1,inplace=True)

In [104]:
df

       Student Name  Student Age  Salary   new
first             A           12    6000  6012
second            B           15    7000  7015
third             C           56    8000  8056
four              D           89    9000  9089

### Sorting Data Frame
DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind=’quicksort’, na_position=’last’)

#### Sorting in ascending order

In [105]:
df.sort_values(['Salary','new'])

       Student Name  Student Age  Salary   new
first             A           12    6000  6012
second            B           15    7000  7015
third             C           56    8000  8056
four              D           89    9000  9089

#### Sorting in descending order

In [106]:
df.sort_values(['Salary','new'],ascending=[False,False])

       Student Name  Student Age  Salary   new
four              D           89    9000  9089
third             C           56    8000  8056
second            B           15    7000  7015
first             A           12    6000  6012

## Filter based on conditional operators

In [116]:
#condition:Return boolean result
df['Salary']>7000

first     False
second    False
third      True
four       True
Name: Salary, dtype: bool

In [113]:
#dataframe[condition]:Return only true row value
df[df['Salary']>7000]

      Student Name  Student Age  Salary   new
third            C           56    8000  8056
four             D           89    9000  9089

In [117]:
#Select salary and student name where salary >7000
df[df['Salary']>7000][['Salary','Student Name']]

       Salary Student Name
third    8000            C
four     9000            D

In [146]:
#select only those observation which salary >7000 and age >56
df[(df['Salary']>7000) & (df['Student Age'] >=15)]

      Student Name  Student Age  Salary   new
third            C           56    8000  8056
four             D           89    9000  9089

In [147]:
#select only those observation which salary >7000 or age >56
df[(df['Salary']>7000) | (df['Student Age'] >=15)]

       Student Name  Student Age  Salary   new
second            B           15    7000  7015
third             C           56    8000  8056
four              D           89    9000  9089

In [149]:
#select only those observation which salary =7000
df[df['Salary']==7000]

       Student Name  Student Age  Salary   new
second            B           15    7000  7015

In [153]:
#select only those observation which salary not equal to 7000
df[df['Salary'] !=7000]

      Student Name  Student Age  Salary   new
first            A           12    6000  6012
third            C           56    8000  8056
four             D           89    9000  9089

## filter() function
DataFrame.filter(self: ~FrameOrSeries, items=None, like: Union[str, NoneType] = None, regex: Union[str, NoneType] = None, axis=None)

In [118]:
# select columns by name
df.filter(items=['Salary','Student Name'])

        Salary Student Name
first     6000            A
second    7000            B
third     8000            C
four      9000            D

In [124]:
# select rows containing 'ion'
df.filter(like='ird', axis=0)

      Student Name  Student Age  Salary   new
third            C           56    8000  8056

In [130]:
# select columns by regular expression
df.filter(regex='Student$', axis=1)

Empty DataFrame
Columns: []
Index: [first, second, third, four]

## Query function
DataFrame.query(self, expr, inplace=False, **kwargs)

In [171]:
df.query('Salary ==8000')

      Student Name  Student Age  Salary   new
third            C           56    8000  8056

In [172]:
df.query('Salary in [8000,7000]')

       Student Name  Student Age  Salary   new
second            B           15    7000  7015
third             C           56    8000  8056

In [173]:
df.query('Salary >= 7000')

       Student Name  Student Age  Salary   new
second            B           15    7000  7015
third             C           56    8000  8056
four              D           89    9000  9089

In [174]:
df.query('Salary >= 5000 & Salary <=8000')

       Student Name  Student Age  Salary   new
first             A           12    6000  6012
second            B           15    7000  7015
third             C           56    8000  8056

In [180]:
df.query('Salary >= 5000 and Salary <=8000')

       Student Name  Student Age  Salary   new
first             A           12    6000  6012
second            B           15    7000  7015
third             C           56    8000  8056

In [185]:
df.query('Salary >= 5000 or Salary <=8000')

       Student Name  Student Age  Salary   new
first             A           12    6000  6012
second            B           15    7000  7015
third             C           56    8000  8056
four              D           89    9000  9089

In [186]:
df.query('Salary not in [8000,7000]')

      Student Name  Student Age  Salary   new
first            A           12    6000  6012
four             D           89    9000  9089

### Reset index

In [137]:
#Reset index
df.reset_index()

    index Student Name  Student Age  Salary   new
0   first            A           12    6000  6012
1  second            B           15    7000  7015
2   third            C           56    8000  8056
3    four            D           89    9000  9089

In [138]:
#set column same is the index
df.set_index('Student Name')

              Student Age  Salary   new
Student Name
A                      12    6000  6012
B                      15    7000  7015
C                      56    8000  8056
D                      89    9000  9089

## Missing Data

In [156]:
d=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
d

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [157]:
#True/False for all value:if missing show True
d.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [158]:
#Show Column wise which columns have nan values(even 1 nan is enough)
d.isna().any()

A     True
B     True
C    False
dtype: bool

In [160]:
#drop missing row
d.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [161]:
#drop missing columns
d.dropna(axis=1)

   C
0  1
1  2
2  3

In [162]:
#drop missing row:(thresh=n)::Keep rows ,if atlest 'n' non-missing is there .
d.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

### Fill missing value
dataframe.fillna(value='fill')

In [176]:
d

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [177]:
#fill missing value with 0 value
d.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [187]:
#fill missing value with mean value in column 'A'
d['A'].fillna(value=d['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group by opration

In [191]:
Name=['A','B','A','C','B']
Salary=[1000,2000,4000,5000,600]
g=pd.DataFrame({'Name':Name,'Salary':Salary})
g

  Name  Salary
0    A    1000
1    B    2000
2    A    4000
3    C    5000
4    B     600

In [199]:
group=g.groupby('Name')

In [209]:
#Average Salary of each Name
group.mean()

      Salary
Name
A       2500
B       1300
C       5000

In [201]:
#minimum Salary of each Name
group.min()

      Salary
Name
A       1000
B        600
C       5000

In [202]:
# Maximum Salary of each Name
group.max()

      Salary
Name
A       4000
B       2000
C       5000

In [203]:
# Count of each Name
group.count()

      Salary
Name
A          2
B          2
C          1

In [204]:
# Total Salary of each Name
group.sum()

      Salary
Name
A       5000
B       2600
C       5000

In [207]:
group.describe()

     Salary
      count    mean          std     min     25%     50%     75%     max
Name
A       2.0  2500.0  2121.320344  1000.0  1750.0  2500.0  3250.0  4000.0
B       2.0  1300.0   989.949494   600.0   950.0  1300.0  1650.0  2000.0
C       1.0  5000.0          NaN  5000.0  5000.0  5000.0  5000.0  5000.0

## Merging Concept : Concatation,Append,Merge,join

In [239]:
ID=[100,101,103,104,108]
Salary=[5000,6000,2000,4000,9000]
df1=pd.DataFrame({'ID':ID,'Salary':Salary})
df1

    ID  Salary
0  100    5000
1  101    6000
2  103    2000
3  104    4000
4  108    9000

In [240]:
ID=[100,101,105,107]
Age=[24,25,34,55]
df2=pd.DataFrame({'ID':ID,'Age':Age})
df2

    ID  Age
0  100   24
1  101   25
2  105   34
3  107   55

### Concatation
concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=None, copy=True)

In [241]:
#Append data frames vertically
pd.concat([df1,df2],sort=False)

    ID  Salary   Age
0  100  5000.0   NaN
1  101  6000.0   NaN
2  103  2000.0   NaN
3  104  4000.0   NaN
4  108  9000.0   NaN
0  100     NaN  24.0
1  101     NaN  25.0
2  105     NaN  34.0
3  107     NaN  55.0

In [242]:
#Concenate data frames horizantal by index
pd.concat([df1,df2],axis=1)

    ID  Salary     ID   Age
0  100    5000  100.0  24.0
1  101    6000  101.0  25.0
2  103    2000  105.0  34.0
3  104    4000  107.0  55.0
4  108    9000    NaN   NaN

In [236]:
pd.concat([df1,df2],axis=1,join='inner')

    ID  Salary   ID  Age
0  100    5000  100   24
1  101    6000  101   25
2  103    2000  105   34
3  104    4000  107   55

### Append
append(other, ignore_index=False, verify_integrity=False, sort=None)

In [222]:
#Append data frames vertically
df1.append(df2,sort=False)

    ID  Salary   Age
0  100  5000.0   NaN
1  101  6000.0   NaN
2  103  2000.0   NaN
3  104  4000.0   NaN
0  100     NaN  24.0
1  101     NaN  25.0
2  105     NaN  34.0
3  107     NaN  55.0

## Merge function
merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)

how : {'left', 'right', 'outer', 'inner'}, default 'inner'
        Type of merge to be performed.
    
        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.

In [247]:
df1

    ID  Salary
0  100    5000
1  101    6000
2  103    2000
3  104    4000
4  108    9000

In [248]:
df2

    ID  Age
0  100   24
1  101   25
2  105   34
3  107   55

### Left join

In [244]:
pd.merge(df1,df2,how='left',on='ID')

    ID  Salary   Age
0  100    5000  24.0
1  101    6000  25.0
2  103    2000   NaN
3  104    4000   NaN
4  108    9000   NaN

### Right join

In [245]:
pd.merge(df1,df2,how='right',on='ID')

    ID  Salary  Age
0  100  5000.0   24
1  101  6000.0   25
2  105     NaN   34
3  107     NaN   55

### Inner join

In [246]:
pd.merge(df1,df2,how='inner',on='ID')

    ID  Salary  Age
0  100    5000   24
1  101    6000   25

### Outer join

In [249]:
pd.merge(df1,df2,how='outer',on='ID')

    ID  Salary   Age
0  100  5000.0  24.0
1  101  6000.0  25.0
2  103  2000.0   NaN
3  104  4000.0   NaN
4  108  9000.0   NaN
5  105     NaN  34.0
6  107     NaN  55.0

In [250]:
pd.merge(df1,df2,how='outer',on='ID',sort=True)

    ID  Salary   Age
0  100  5000.0  24.0
1  101  6000.0  25.0
2  103  2000.0   NaN
3  104  4000.0   NaN
4  105     NaN  34.0
5  107     NaN  55.0
6  108  9000.0   NaN

### Join Function
join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)

how : {'left', 'right', 'outer', 'inner'}, default 'left'
        How to handle the operation of the two objects.
    
        * left: use calling frame's index (or column if on is specified)
        * right: use `other`'s index.
        * outer: form union of calling frame's index (or column if on isspecified) with `other`'s index, and sort it.
          lexicographically.
        * inner: form intersection of calling frame's index (or column ifon is specified) with `other`'s index, preserving              the order of the calling's one.

In [261]:
df1

    ID  Salary
0  100    5000
1  101    6000
2  103    2000
3  104    4000
4  108    9000

In [262]:
df2

    ID  Age
0  100   24
1  101   25
2  105   34
3  107   55

In [259]:
df1.join(df2,how='left',sort=True,lsuffix='_l',rsuffix='_r')

   ID_l  Salary   ID_r   Age
0   100    5000  100.0  24.0
1   101    6000  101.0  25.0
2   103    2000  105.0  34.0
3   104    4000  107.0  55.0
4   108    9000    NaN   NaN

In [272]:
df1.join(df2,how='left',sort=True,lsuffix='_l',rsuffix='_r',on='ID')

    ID  ID_l  Salary  ID_r  Age
0  100   100    5000   NaN  NaN
1  101   101    6000   NaN  NaN
2  103   103    2000   NaN  NaN
3  104   104    4000   NaN  NaN
4  108   108    9000   NaN  NaN

In [260]:
df1.join(df2,how='inner',sort=True,lsuffix='_l',rsuffix='_r')

   ID_l  Salary  ID_r  Age
0   100    5000   100   24
1   101    6000   101   25
2   103    2000   105   34
3   104    4000   107   55

### Join vs Merge

1. join is based on index <br>
2. Merge is based on particular column each of two dataframe

In [274]:

df1.join(df2,how='inner',sort=True,lsuffix='_l',rsuffix='_r')

   ID_l  Salary  ID_r  Age
0   100    5000   100   24
1   101    6000   101   25
2   103    2000   105   34
3   104    4000   107   55

In [275]:
df1.merge(df2,how='inner', left_index=True, right_index=True, sort=True, suffixes=('_l', '_r'))

   ID_l  Salary  ID_r  Age
0   100    5000   100   24
1   101    6000   101   25
2   103    2000   105   34
3   104    4000   107   55

In [276]:
pd.merge(df1,df2,how='inner',on='ID')

    ID  Salary  Age
0  100    5000   24
1  101    6000   25

### Pandas concat vs append vs join vs merge

* Concat gives the flexibility to join based on the axis( all rows or all columns)
* Append is the specific case(axis=0, join='outer') of concat
* Join is based on the indexes (set by set_index) on how variable =['left','right','inner','couter']
* Merge is based on any particular column each of the two dataframes, this columns are variables on like 'left_on', 'right_on', 'on'

In [277]:
#Concenate data frames horizantal by index
pd.concat([df1,df2],axis=1)

    ID  Salary     ID   Age
0  100    5000  100.0  24.0
1  101    6000  101.0  25.0
2  103    2000  105.0  34.0
3  104    4000  107.0  55.0
4  108    9000    NaN   NaN

In [280]:
df1.join(df2,how='left',sort=True,lsuffix='_l',rsuffix='_r')

   ID_l  Salary   ID_r   Age
0   100    5000  100.0  24.0
1   101    6000  101.0  25.0
2   103    2000  105.0  34.0
3   104    4000  107.0  55.0
4   108    9000    NaN   NaN

### Other Operaion

####  Find unique in column 'ID'

In [288]:
df1['ID'].unique()

array([100, 101, 103, 104, 108], dtype=int64)

In [289]:
#Total unique element in column 'ID'
df1['ID'].nunique()

5

In [290]:
#Total unique element in column 'ID'
len(df1['ID'].unique())

5

### Apply() method
DataFrame.apply(self, func, axis=0, broadcast=None, raw=False, reduce=None, result_type=None, args=())

Objects passed to the function are Series objects whose index is either the DataFrame’s index (axis=0) or the DataFrame’s columns (axis=1).

In [298]:
df1

    ID  Salary
0  100    5000
1  101    6000
2  103    2000
3  104    4000
4  108    9000

In [304]:
#default axis=0
df1.apply(np.sum)

ID          516
Salary    26000
dtype: int64

In [302]:
#SUM column Wise
df1.apply(np.sum,axis=0)

ID          516
Salary    26000
dtype: int64

In [303]:
#SUM row wise
df1.apply(np.sum,axis=1)

0    5100
1    6101
2    2103
3    4104
4    9108
dtype: int64

In [305]:
#add 2 in all the element
df1.apply(lambda x:x+2)

    ID  Salary
0  102    5002
1  103    6002
2  105    2002
3  106    4002
4  110    9002

### Pivot Table
pandas.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False)

In [314]:
pd.pivot_table(df1,values='Salary',columns=['ID'],aggfunc=np.sqrt)

ID            100        101       103        104       108
Salary  70.710678  77.459667  44.72136  63.245553  94.86833

In [315]:
pd.pivot_table(df1,values='Salary',index=['ID'],aggfunc=np.sqrt)

        Salary
ID
100  70.710678
101  77.459667
103  44.721360
104  63.245553
108  94.868330

### SQL

In [317]:
#!pip install sqlalchemy
from sqlalchemy import create_engine

Once the library is imported, we need to create a SQL engine using this command which creates a new class`.Engine` instance.

In [324]:
engine = create_engine('sqlite:///:memory:', echo=True)

In [323]:
sql = ''' 
SELECT *
FROM df1
'''


df = pd.read_sql_query(sql, engine)
df.head()

OperationalError: (sqlite3.OperationalError) no such table: df1
[SQL:
SELECT *
FROM df1
]
(Background on this error at: http://sqlalche.me/e/e3q8)